{
  "featured": 0,

  "projects": [

    {
      "title": "GlowingSquare",
      "date": "Summer 2020",
      "image": "glowingsquare.jpg",
      "description": "A purpose-built display based on a 64x32 LED matrix and an ESP32. The code can be easily adapted for other purposes, and includes code to fetch web requests, store config, etc.",
      "long_description": "I have made three displays so far: one that shows the current London Tube departures for my local station with data from TfL, one that shows planes flying over my house with data from Flightradar24 based on this project, and one that shows network statistics for my Unifi-based home network.",
      "link": "https://github.com/alfo/GlowingSquare"
    },

    {
      "title": "Focus Mate App",
      "date": "October 2015",
      "image": "focus-mate.jpg",
      "description": "My first Swift iOS App: Voice control for the most popular theatrical lighting consoles from your Apple Watch",
      "long_description": "When working on shows by myself, I often found that it would be useful to be able to control the EOS series of consoles remotely. In the summer of 2015, ETC finalised their OSC specification, and a few months later I released my own voice-based remote to go with my Apple Watch.",
      "link": "https://alexforey.com/focus-mate"
    },

    {
      "title": "Arduino ArtNet Node",
      "date": "May 2015",
      "image": "artnet.jpg",
      "description": "An Arduino-based ethernet to DMX converted, allowing me to control entertainment lighting systems from my laptop",
      "long_description": "An Arduino-based ethernet to DMX converted, allowing me to control entertainment lighting systems from my laptop, supporting 2 seperate addressable universes with 5-pin and 3-pin XLR output. Settings can be changed via a web UI, and the node has been tested as fully working with both ETC Nomad and QLC+.",
      "link": "https://github.com/alfo/artnet"
    },

    {
      "title": "Door Sign",
      "date": "September 2014",
      "image": "door-sign.jpg",
      "description": "A sign for my bedroom door that shows what's currently happening in my calendar, based off a Spark Core.",
      "long_description": "A sign for my bedroom door that shows what's currently happening in my calendar, based off a Spark Core and a &pound;5 display from eBay. I also wrote a <a href='http://newfangled.me/door-sign/'>blog post</a> about why I made it and how I use it.",
      "link": "https://github.com/alfo/door-sign"
    }
  ]
}
